app/views/users/show.html.erb

SELECT "puzzles".* FROM "puzzles" INNER JOIN "wins" ON "puzzles"."id" = "wins"."puzzle_id" WHERE "wins"."user_id" = $1  [["user_id", 8]]
---
    <% if win.user_id == @user.id %>
    <% @puzzle=Puzzle.find(win.puzzle_id) %>