app/controllers/puzzles_controller.rb

  def levels
       @puzzles_unordered= User.find_by(user_name:"DZack").puzzles
       @puzzles= []

       for i in 1..10
         @puzzles_unordered.each do |puzzle|
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT 1  [["user_name", "DZack"]]
SELECT "puzzles".* FROM "puzzles" WHERE "puzzles"."user_id" = $1  [["user_id", 5]]

  def index
    @puzzles= Puzzle.all
---
SELECT "puzzles".* FROM "puzzles"

  def show
      @puzzle= Puzzle.find(params[:id])
---
SELECT  "puzzles".* FROM "puzzles" WHERE "puzzles"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @puzzle=Puzzle.find(params[:id])
---
SELECT  "puzzles".* FROM "puzzles" WHERE "puzzles"."id" = $1 LIMIT 1  [["id", 26]]

  def update
    @puzzle= Puzzle.find(params[:id])
    @puzzle.update(puzzle_params)
---
SELECT  "puzzles".* FROM "puzzles" WHERE "puzzles"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "puzzles" SET "notes" = $1, "updated_at" = $2 WHERE "puzzles"."id" = $3  [["notes", "WORK"], ["updated_at", "2015-11-07 21:55:39.679866"], ["id", 1]]

  def create
    @puzzle= Puzzle.new puzzle_params

    @puzzle.user_id = current_user.id
    #@puzzle.clicks_created= 3
    @puzzle.save
---
INSERT INTO "puzzles" ("notes", "pattern", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["notes", ""], ["pattern", ""], ["user_id", 1], ["created_at", "2015-11-09 01:09:15.185821"], ["updated_at", "2015-11-09 01:09:15.185821"]]

  def win
      @puzzle= Puzzle.find(params[:id])
      user_id = current_user.id
      #figure out of the win should count:
      count_win = true
      @wins= Win.all
      @wins.each_with_index do |win|
        #if user has already beaten this puzzle,
        if win.user_id==user_id
          if win.puzzle_id==@puzzle.id
            #don't count it
            count_win=false
            break
          end
        end
      end
      #if it survived the loop, generate new Win object, gives it appropriate puzzle and user id
      if count_win
        @win= Win.new
        @win.user_id=current_user.id
        @win.puzzle_id=@puzzle.id
        #@win.clicks?
        @win.save
        # @puzzle.best_solution < @win.clicks
        #check to see if the clicks it took to win is the best solution; if so, update best solution
        # @puzzle.best_solution=@win.clicks
        @puzzle.best_solver=current_user.user_name
        @puzzle.save
---
SELECT  "puzzles".* FROM "puzzles" WHERE "puzzles"."id" = $1 LIMIT 1  [["id", 29]]
SELECT "wins".* FROM "wins"
INSERT INTO "wins" ("user_id", "puzzle_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 8], ["puzzle_id", 29], ["created_at", "2015-11-07 21:07:39.082240"], ["updated_at", "2015-11-07 21:07:39.082240"]]
UPDATE "puzzles" SET "best_solver" = $1, "updated_at" = $2 WHERE "puzzles"."id" = $3  [["best_solver", "DZack"], ["updated_at", "2015-12-04 18:17:21.961383"], ["id", 7]]

  def destroy
    @puzzle=Puzzle.find(params[:id])
     @win=Win.where(puzzle_id: @puzzle.id)
     unless @win==[]
       @win.each do |win|
         Win.delete(win.id)
---
SELECT  "puzzles".* FROM "puzzles" WHERE "puzzles"."id" = $1 LIMIT 1  [["id", 25]]
SELECT "wins".* FROM "wins" WHERE "wins"."puzzle_id" = $1  [["puzzle_id", 1]]
SELECT  "wins".* FROM "wins" WHERE "wins"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "puzzles" WHERE "puzzles"."id" = $1  [["id", 25]]
DELETE FROM "wins" WHERE "wins"."id" = $1  [["id", 1]]