app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_name", "susan"], ["email", "susan@gmail.com"], ["created_at", "2015-11-05 19:21:40.627041"], ["updated_at", "2015-11-05 19:21:40.627041"]]
---
  def create
    @user = User.new user_params
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "wins".* FROM "wins"
---
  def show
    @user = User.find(params[:id])
    @wins=Win.all